{ "id" : "tt0848228", "name" : "The Avengers", "storyline" : "Nick Fury is director of S.H.I.E.L.D, an international peace keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster.", "cast" : ["nm0000375","nm0262635","nm0749263","nm1165110","nm0424060","nm0719637","nm0000168"] }
{ "id" : "tt1843866", "name" : "Captain America: The Winter Soldier", "storyline" : "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That comes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization. Now a fugitive, Captain America must get to the bottom of this deadly mystery with the help of the Black Widow and his new friend, The Falcon. However, the battle will be costly for the Sentinel of Liberty, with Rogers finding enemies where he least expects them while learning that the Winter Soldier looks disturbingly familiar.", "cast" : ["nm0262635","nm0000168","nm0424060","nm0000602","nm1659221","nm1107001"]}
{ "id" : "tt1300854", "name" : "Iron Man 3", "storyline" : "Marvel\\'s Iron Man 3 pits brash-but-brilliant industrialist Tony Stark/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Stark is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Stark discovers the answer to the question that has secretly haunted him: does the man make the suit or does the suit make the man?", "cast" : ["nm0000375","nm0000569","nm0000332","nm0001602","nm0356017","nm0269463","nm0001426"]}